; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          airplane - vehicle
          package
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?loc - place ?city - city)
		(at ?obj - physobj ?loc - place)
		(in ?pkg - package ?veh - vehicle))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (at ?airplane ?loc-from)
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-04-0)
(:domain logistics)
(:objects
apn1 apn2 - airplane
apt1 apt2 - airport
pos21 pos22 pos23 pos11 pos12 pos13 - location
cit2 cit1 - city
tru21 tru22 tru23 tru11 tru12 tru13 - truck
obj23 obj22 obj21 obj13 obj12 obj11 - package)

(:init
(at apn1 apt2) (at apn2 apt1)
(at tru11 pos11) (at tru21 pos21) (at tru12 pos12) (at tru22 pos22) (at tru13 pos13) (at tru23 pos23)
(at obj11 pos11) (at obj12 pos12) (at obj13 pos13)
(at obj21 pos21) (at obj22 pos22) (at obj23 pos23)
(in-city apt1 cit1) (in-city pos11 cit1) (in-city pos12 cit1) (in-city pos13 cit1)
(in-city apt2 cit2) (in-city pos21 cit2) (in-city pos22 cit2) (in-city pos23 cit2)
)

(:goal (and
(at obj11 pos22)
(at obj13 pos23)
)
)
)

; plan
1. (load-truck obj13 tru13 pos13)
   deleted: (at obj13 pos13)
   added: (in obj13 tru13)
   goals met: 0 of 2
2. (drive-truck tru13 pos13 apt1 cit1)
   deleted: (at tru13 pos13)
   added: (at tru13 apt1)
   goals met: 0 of 2
3. (unload-truck obj13 tru13 apt1)
   deleted: (in obj13 tru13)
   added: (at obj13 apt1)
   goals met: 0 of 2
4. (load-truck obj11 tru11 pos11)
   deleted: (at obj11 pos11)
   added: (in obj11 tru11)
   goals met: 0 of 2
5. (drive-truck tru11 pos11 apt1 cit1)
   deleted: (at tru11 pos11)
   added: (at tru11 apt1)
   goals met: 0 of 2
6. (unload-truck obj11 tru11 apt1)
   deleted: (in obj11 tru11)
   added: (at obj11 apt1)
   goals met: 0 of 2
7. (load-airplane obj13 apn2 apt1)
   deleted: (at obj13 apt1)
   added: (in obj13 apn2)
   goals met: 0 of 2
8. (load-airplane obj11 apn2 apt1)
   deleted: (at obj11 apt1)
   added: (in obj11 apn2)
   goals met: 0 of 2
9. (fly-airplane apn2 apt1 apt2)
   deleted: (at apn2 apt1)
   added: (at apn2 apt2)
   goals met: 0 of 2
10. (unload-airplane obj13 apn2 apt2)
   deleted: (in obj13 apn2)
   added: (at obj13 apt2)
   goals met: 0 of 2
11. (unload-airplane obj11 apn2 apt2)
   deleted: (in obj11 apn2)
   added: (at obj11 apt2)
   goals met: 0 of 2
12. (drive-truck tru22 pos22 apt2 cit2)
   deleted: (at tru22 pos22)
   added: (at tru22 apt2)
   goals met: 0 of 2
13. (load-truck obj13 tru22 apt2)
   deleted: (at obj13 apt2)
   added: (in obj13 tru22)
   goals met: 0 of 2
14. (load-truck obj11 tru22 apt2)
   deleted: (at obj11 apt2)
   added: (in obj11 tru22)
   goals met: 0 of 2
15. (drive-truck tru22 apt2 pos22 cit2)
   deleted: (at tru22 apt2)
   added: (at tru22 pos22)
   goals met: 0 of 2
16. (unload-truck obj11 tru22 pos22)
   deleted: (in obj11 tru22)
   added: (at obj11 pos22)
   goals met: 1 of 2
17. (drive-truck tru22 pos22 pos23 cit2)
   deleted: (at tru22 pos22)
   added: (at tru22 pos23)
   goals met: 1 of 2
18. (unload-truck obj13 tru22 pos23)
   deleted: (in obj13 tru22)
   added: (at obj13 pos23)
   goals met: 2 of 2
